import React from 'react';
import PropTypes from 'prop-types';
import jMoment from 'moment-jalaali';
import Month from './Month';
import {Card, Row, Col} from 'antd';

@autobind
/**
 *
 */
export default class Year extends React.PureComponent {
  static propTypes = {
    year: PropTypes.number,
    selected: PropTypes.arrayOf(
      PropTypes.shape({
        start: PropTypes.string,
        end: PropTypes.string,
      }),
    ),
    start: PropTypes.string,
    disabled: PropTypes.func,
    onMonthClick: PropTypes.func,
    onWeekDayClick: PropTypes.func,
    onMouseDown: PropTypes.func,
    onMouseUp: PropTypes.func,
    events: PropTypes.arrayOf(
      PropTypes.shape({
        date: PropTypes.string,
        color: PropTypes.string,
        content: PropTypes.string,
      }),
    ),
    statuses: PropTypes.arrayOf(
      PropTypes.shape({
        date: PropTypes.string,
        color: PropTypes.string,
        title: PropTypes.string,
        description: PropTypes.string,
      }),
    ),
  };

  static defaultProps = {
    year: jMoment().jYear(),
    disabled: (date) => {
    },
    onMonthClick: (month) => {
    },
    onWeekDayClick: (month, weekDay) => {
    },
    onMouseDown: (date) => {
    },
    onMouseUp: (date) => {
    },
    selected: [],
    events: [],
    statuses: [],
    start: null,
  };

  /**
   *
   * @param {String} _date
   * @param {String} separator
   * @return {String}
   * @private
   */
  _GregorianToHejri(_date, separator = '-') {
    let base = 1948085;
    let kabise = [];
    kabise[0] = 0;
    kabise[1] = 354;
    kabise[2] = 708; //
    kabise[3] = 1063;
    kabise[4] = 1417;
    kabise[5] = 1771;
    kabise[6] = 2126;
    kabise[7] = 2480; //
    kabise[8] = 2835;
    kabise[9] = 3189;
    kabise[10] = 3543; //
    kabise[11] = 3898;
    kabise[12] = 4252;
    kabise[13] = 4606; //
    kabise[14] = 4961;
    kabise[15] = 5315;
    kabise[16] = 5669; //
    kabise[17] = 6024;
    kabise[18] = 6378; //
    kabise[19] = 6733;
    kabise[20] = 7087;
    kabise[21] = 7441; //
    kabise[22] = 7796;
    kabise[23] = 8150;
    kabise[24] = 8504; //
    kabise[25] = 8859;
    kabise[26] = 9213; //
    kabise[27] = 9568;
    kabise[28] = 9922;
    kabise[29] = 10276; //
    kabise[30] = 10631;

    let mon = [];
    mon[1] = 0;
    mon[2] = 29;
    mon[3] = 59;
    mon[4] = 89;
    mon[5] = 118;
    mon[6] = 148;
    mon[7] = 177;
    mon[8] = 207;
    mon[9] = 236;
    mon[10] = 266;
    mon[11] = 295;
    mon[12] = 325;

    let date = _date.split(separator);
    let D = parseInt(date[2]);
    let M = parseInt(date[1]);
    let Y = parseInt(date[0]);
    if (M < 3) {
      Y--;
      M += 12;
    }


    let A = Math.floor(Y / 100);
    let B = Math.floor(A / 4);
    let C = 2 - A + B;
    let E = Math.floor(365.25 * (Y + 4716));
    let F = Math.floor(30.6001 * (M + 1));
    let julianday = C + eval(D) + E + F - 1524.5 + 0.5;

    let a = julianday - base;
    let b = parseInt(a / 10631);
    let c = a % 10631;
    let d = 0;
    for (let i = 0; i < 31; i++) {
      if (kabise[i] < c) {
        d = i;
      } else {
        break;
      }
    }
    let e = c - kabise[d];
    let f = 0;
    for (let j = 1; j < 13; j++) {
      if (mon[j] < e) {
        f = j;
      } else {
        break;
      }
    }

    let g = e - mon[f];

    return `${(b * 30) + d}${separator}${f > 9.99 ? parseInt(f) : `0${parseInt(f)}`}${separator}${g > 9.99 ? parseInt(g) : `0${parseInt(g)}`}`;
  }

  /**
   *
   * @param {String} _date
   * @param {String} separator
   * @return {String}
   * @private
   */
  _HejriToGregorian(_date, separator = '-') {
    let base = 1948085;
    let kabise = [];
    kabise[0] = 0;
    kabise[1] = 354;
    kabise[2] = 708; //
    kabise[3] = 1063;
    kabise[4] = 1417;
    kabise[5] = 1771;
    kabise[6] = 2126;
    kabise[7] = 2480; //
    kabise[8] = 2835;
    kabise[9] = 3189;
    kabise[10] = 3543; //
    kabise[11] = 3898;
    kabise[12] = 4252;
    kabise[13] = 4606; //
    kabise[14] = 4961;
    kabise[15] = 5315;
    kabise[16] = 5669; //
    kabise[17] = 6024;
    kabise[18] = 6378; //
    kabise[19] = 6733;
    kabise[20] = 7087;
    kabise[21] = 7441; //
    kabise[22] = 7796;
    kabise[23] = 8150;
    kabise[24] = 8504; //
    kabise[25] = 8859;
    kabise[26] = 9213; //
    kabise[27] = 9568;
    kabise[28] = 9922;
    kabise[29] = 10276; //
    kabise[30] = 10631;

    let mon = [];
    mon[1] = 0;
    mon[2] = 29;
    mon[3] = 59;
    mon[4] = 89;
    mon[5] = 118;
    mon[6] = 148;
    mon[7] = 177;
    mon[8] = 207;
    mon[9] = 236;
    mon[10] = 266;
    mon[11] = 295;
    mon[12] = 325;


    let date = _date.split(separator);
    let a = date[0] % 30;
    let b = parseInt(date[0] / 30) * 10631;
    let c = kabise[a] + b;
    let d = mon[parseInt(date[1])] + c;
    let e = d + parseInt(date[2]);

    let JD = base + e - 0.5;

    let Z = JD + 0.5;
    let F = Z - Math.floor(Z);
    Z = Math.floor(Z);
    let W = Math.floor((Z - 1867216.25) / 36524.25);
    let X = Math.floor(W / 4);
    let A = Z + 1 + W - X;
    let B = A + 1524;
    let C = Math.floor((B - 122.1) / 365.25);
    let D = Math.floor(365.25 * C);
    let E = Math.floor((B - D) / 30.6001);

    let NewMonth = E > 13 ? E - 13 : E - 1;
    let NewDay = B - D - Math.floor(30.6001 * E) + F;
    let NewYear = NewMonth < 3 ? C - 4715 : C - 4716;

    return `${NewYear}${separator}${NewMonth > 9.99 ? parseInt(NewMonth) : `0${parseInt(NewMonth)}`}${separator}${NewDay > 9.99 ? parseInt(NewDay) : `0${parseInt(NewDay)}`}`;

  }

  /**
   *
   * @param {String} date
   * @return {String}
   * @private
   */
  _ShamsiToHejri(date) {
    return this._GregorianToHejri(jMoment(date, 'jYYYY-jMM-jDD').format('YYYY-MM-DD'));
  }

  /**
   *
   * @param {String} date
   * @return {*}
   * @private
   */
  _HejriToShamsi(date) {
    return jMoment(this._HejriToGregorian(date), 'YYYY-MM-DD').format('jYYYY-jMM-jDD');
  }

  /**
   *
   * @param {String} year
   * @return {*}
   * @private
   */
  _Holiday(year) {
    const {statuses} = this.props;

    let _statuses = statuses;

    let shamsi = {
      '01-01': 'جشن نوروز/جشن سال نو',
      '01-02': 'عیدنوروز',
      '01-03': 'عیدنوروز',
      '01-04': 'عیدنوروز',
      '01-12': 'روز جمهوری اسلامی ایران',
      '01-13': 'جشن سیزده به در',
      '03-14': 'رحلت حضرت امام خمینی',
      '03-15': 'قیام 15 خرداد',
      '11-22': 'پیروزی انقلاب اسلامی',
      '12-29': 'روز ملی شدن صنعت نفت ایران',
    };
    let kabise = {
      '12-30': 'آخرین روز سال',
    };
    // let ghamari = {
    //   '01-09': 'تاسوعای حسینی',
    //   '01-10': 'عاشورای حسینی',
    //   '02-20': 'اربعین حسینی',
    //   '02-28': 'رحلت رسول اکرم؛شهادت امام حسن مجتبی علیه السلام',
    //   '02-30': 'شهادت امام رضا علیه السلام',
    //   '03-08': 'شهادت امام حسن عسکری علیه السلام',
    //   '03-17': 'میلاد رسول اکرم و امام جعفر صادق علیه السلام',
    //   '07-13': 'ولادت امام علی علیه السلام و روز پدر',
    //   '07-27': 'مبعث رسول اکرم',
    //   '08-15': 'ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان',
    //   '09-21': 'شهادت حضرت علی علیه السلام',
    //   '10-01': 'عید سعید فطر',
    //   '10-02': 'تعطیل به مناسبت عید سعید فطر',
    //   '10-25': 'شهادت امام جعفر صادق علیه السلام',
    //   '12-10': 'عید سعید قربان',
    //   '12-18': 'عید سعید غدیر خم',
    // };
    let ramezan = {
      '1390': ['05-10', '06-08'],
      '1391': ['04-31', '05-28'],
      '1392': ['04-19', '05-28'],
      '1393': ['04-08', '05-06'],
      '1394': ['03-28', '04-26'],
      '1395': ['03-18', '04-15'],
      '1396': ['03-06', '04-06'],
      '1397': ['02-27', '03-26'],
      '1398': ['02-16', '03-13'],
      '1399': ['02-05', '03-03'],
      '1400': ['01-24', '02-22'],
      '1401': ['01-13', '02-11'],
      '1402': ['01-03', '01-31'],
    };
    let ghamari = {
      '1390': {
        '09-14': 'تاسوعای حسینی',
        '09-15': 'عاشورای حسینی',
        '10-24': 'اربعین حسینی',
        '11-02': 'رحلت رسول اکرم؛شهادت امام حسن مجتبی علیه السلام',
        '11-04': 'شهادت امام رضا علیه السلام',
        '11-12': 'شهادت امام حسن عسکری علیه السلام',
        '11-21': 'میلاد رسول اکرم و امام جعفر صادق علیه السلام',
        '02-17': 'شهادت حضرت فاطمه زهرا سلام الله علیها',
        '03-26': 'ولادت امام علی علیه السلام و روز پدر',
        '04-09': 'مبعث رسول اکرم',
        '04-26': 'ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان',
        '05-30': 'شهادت حضرت علی علیه السلام',
        '06-09': 'عید سعید فطر',
        '06-10': 'تعطیل به مناسبت عید سعید فطر',
        '07-02': 'شهادت امام جعفر صادق علیه السلام',
        '08-16': 'عید سعید قربان',
        '08-24': 'عید سعید غدیر خم',
      },
      '1391': {
        '09-04': 'تاسوعای حسینی',
        '09-05': 'عاشورای حسینی',
        '10-14': 'اربعین حسینی',
        '10-22': 'رحلت رسول اکرم؛شهادت امام حسن مجتبی علیه السلام',
        '10-23': 'شهادت امام رضا علیه السلام',
        '11-01': 'شهادت امام حسن عسکری علیه السلام',
        '11-10': 'میلاد رسول اکرم و امام جعفر صادق علیه السلام',
        '02-06': 'شهادت حضرت فاطمه زهرا سلام الله علیها',
        '03-15': 'ولادت امام علی علیه السلام و روز پدر',
        '03-29': 'مبعث رسول اکرم',
        '04-15': 'ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان',
        '05-20': 'شهادت حضرت علی علیه السلام',
        '05-29': 'عید سعید فطر',
        '05-30': 'تعطیل به مناسبت عید سعید فطر',
        '06-22': 'شهادت امام جعفر صادق علیه السلام',
        '08-05': 'عید سعید قربان',
        '08-13': 'عید سعید غدیر خم',
      },
      '1392': {
        '08-22': 'تاسوعای حسینی',
        '08-23': 'عاشورای حسینی',
        '10-02': 'اربعین حسینی',
        '10-10': 'رحلت رسول اکرم؛شهادت امام حسن مجتبی علیه السلام',
        '10-12': 'شهادت امام رضا علیه السلام',
        '10-20': 'شهادت امام حسن عسکری علیه السلام',
        '10-29': 'میلاد رسول اکرم و امام جعفر صادق علیه السلام',
        '01-25': 'شهادت حضرت فاطمه زهرا سلام الله علیها',
        '02-03': 'ولادت امام علی علیه السلام و روز پدر',
        '02-17': 'مبعث رسول اکرم',
        '01-03': 'ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان',
        '05-08': 'شهادت حضرت علی علیه السلام',
        '05-18': 'عید سعید فطر',
        '05-19': 'تعطیل به مناسبت عید سعید فطر',
        '06-11': 'شهادت امام جعفر صادق علیه السلام',
        '07-24': 'عید سعید قربان',
        '08-02': 'عید سعید غدیر خم',
      },
      '1393': {
        '08-12': 'تاسوعای حسینی',
        '08-13': 'عاشورای حسینی',
        '09-22': 'اربعین حسینی',
        '09-30': 'رحلت رسول اکرم؛شهادت امام حسن مجتبی علیه السلام',
        '10-02': 'شهادت امام رضا علیه السلام',
        '10-10': 'شهادت امام حسن عسکری علیه السلام',
        '10-19': 'میلاد رسول اکرم و امام جعفر صادق علیه السلام',
        '01-14': 'شهادت حضرت فاطمه زهرا سلام الله علیها',
        '02-23': 'ولادت امام علی علیه السلام و روز پدر',
        '03-06': 'مبعث رسول اکرم',
        '03-23': 'ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان',
        '04-28': 'شهادت حضرت علی علیه السلام',
        '05-07': 'عید سعید فطر',
        '05-08': 'تعطیل به مناسبت عید سعید فطر',
        '05-31': 'شهادت امام جعفر صادق علیه السلام',
        '07-13': 'عید سعید قربان',
        '07-21': 'عید سعید غدیر خم',
      },
      '1394': {
        '08-01': 'تاسوعای حسینی',
        '08-02': 'عاشورای حسینی',
        '09-11': 'اربعین حسینی',
        '09-19': 'رحلت رسول اکرم؛شهادت امام حسن مجتبی علیه السلام',
        '09-21': 'شهادت امام رضا علیه السلام',
        '09-29': 'شهادت امام حسن عسکری علیه السلام',
        '10-08': 'میلاد رسول اکرم و امام جعفر صادق علیه السلام',
        '12-23': 'شهادت حضرت فاطمه زهرا سلام الله علیها',
        '01-04': 'شهادت حضرت فاطمه زهرا سلام الله علیها',
        '02-12': 'ولادت امام علی علیه السلام و روز پدر',
        '02-26': 'مبعث رسول اکرم',
        '03-13': 'ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان',
        '04-17': 'شهادت حضرت علی علیه السلام',
        '04-27': 'عید سعید فطر',
        '04-28': 'تعطیل به مناسبت عید سعید فطر',
        '05-20': 'شهادت امام جعفر صادق علیه السلام',
        '07-02': 'عید سعید قربان',
        '07-10': 'عید سعید غدیر خم',
      },
      '1395': {
        '07-20': 'تاسوعای حسینی',
        '07-21': 'عاشورای حسینی',
        '08-30': 'اربعین حسینی',
        '09-08': 'رحلت رسول اکرم؛شهادت امام حسن مجتبی علیه السلام',
        '09-10': 'شهادت امام رضا علیه السلام',
        '09-18': 'شهادت امام حسن عسکری علیه السلام',
        '09-27': 'میلاد رسول اکرم و امام جعفر صادق علیه السلام',
        '12-12': 'شهادت حضرت فاطمه زهرا سلام الله علیها',
        '02-02': 'ولادت امام علی علیه السلام و روز پدر',
        '02-16': 'مبعث رسول اکرم',
        '03-02': 'ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان',
        '04-07': 'شهادت حضرت علی علیه السلام',
        '04-16': 'عید سعید فطر',
        '04-17': 'تعطیل به مناسبت عید سعید فطر',
        '05-09': 'شهادت امام جعفر صادق علیه السلام',
        '06-22': 'عید سعید قربان',
        '06-30': 'عید سعید غدیر خم',
      },
      '1396': {
        '07-08': 'تاسوعای حسینی',
        '07-09': 'عاشورای حسینی',
        '08-18': 'اربعین حسینی',
        '08-26': 'رحلت رسول اکرم؛شهادت امام حسن مجتبی علیه السلام',
        '08-28': 'شهادت امام رضا علیه السلام',
        '09-06': 'شهادت امام حسن عسکری علیه السلام',
        '09-15': 'میلاد رسول اکرم و امام جعفر صادق علیه السلام',
        '12-01': 'شهادت حضرت فاطمه زهرا سلام الله علیها',
        '01-22': 'ولادت امام علی علیه السلام و روز پدر',
        '02-05': 'مبعث رسول اکرم',
        '02-22': 'ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان',
        '03-26': 'شهادت حضرت علی علیه السلام',
        '04-05': 'عید سعید فطر',
        '04-06': 'تعطیل به مناسبت عید سعید فطر',
        '04-29': 'شهادت امام جعفر صادق علیه السلام',
        '06-10': 'عید سعید قربان',
        '06-18': 'عید سعید غدیر خم',
      },
      '1397': {
        '06-28': 'تاسوعای حسینی',
        '06-29': 'عاشورای حسینی',
        '08-08': 'اربعین حسینی',
        '08-16': 'رحلت رسول اکرم؛شهادت امام حسن مجتبی علیه السلام',
        '08-17': 'شهادت امام رضا علیه السلام',
        '08-25': 'شهادت امام حسن عسکری علیه السلام',
        '09-04': 'میلاد رسول اکرم و امام جعفر صادق علیه السلام',
        '12-20': 'شهادت حضرت فاطمه زهرا سلام الله علیها',
        '12-29': 'ولادت امام علی علیه السلام و روز پدر',
        '01-11': 'ولادت امام علی علیه السلام و روز پدر',
        '01-25': 'مبعث رسول اکرم',
        '02-12': 'ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان',
        '03-16': 'شهادت حضرت علی علیه السلام',
        '03-25': 'عید سعید فطر',
        '03-26': 'تعطیل به مناسبت عید سعید فطر',
        '04-18': 'شهادت امام جعفر صادق علیه السلام',
        '05-31': 'عید سعید قربان',
        '06-08': 'عید سعید غدیر خم',
      },
      '1398': {
        '06-17': 'تاسوعای حسینی',
        '06-18': 'عاشورای حسینی',
        '07-27': 'اربعین حسینی',
        '08-05': 'رحلت رسول اکرم؛شهادت امام حسن مجتبی علیه السلام',
        '08-06': 'شهادت امام رضا علیه السلام',
        '08-14': 'شهادت امام حسن عسکری علیه السلام',
        '08-23': 'میلاد رسول اکرم و امام جعفر صادق علیه السلام',
        '11-08': 'شهادت حضرت فاطمه زهرا سلام الله علیها',
        '12-18': 'ولادت امام علی علیه السلام و روز پدر',
        '01-14': 'مبعث رسول اکرم',
        '01-31': 'ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان',
        '03-05': 'شهادت حضرت علی علیه السلام',
        '03-14': 'عید سعید فطر',
        '03-15': 'تعطیل به مناسبت عید سعید فطر',
        '04-07': 'شهادت امام جعفر صادق علیه السلام',
        '05-20': 'عید سعید قربان',
        '05-28': 'عید سعید غدیر خم',
      },
      '1399': {
        '06-07': 'تاسوعای حسینی',
        '06-08': 'عاشورای حسینی',
        '07-16': 'اربعین حسینی',
        '07-24': 'رحلت رسول اکرم؛شهادت امام حسن مجتبی علیه السلام',
        '07-26': 'شهادت امام رضا علیه السلام',
        '08-04': 'شهادت امام حسن عسکری علیه السلام',
        '08-13': 'میلاد رسول اکرم و امام جعفر صادق علیه السلام',
        '10-27': 'شهادت حضرت فاطمه زهرا سلام الله علیها',
        '12-07': 'ولادت امام علی علیه السلام و روز پدر',
        '12-21': 'مبعث رسول اکرم',
        '01-03': 'مبعث رسول اکرم',
        '01-20': 'ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان',
        '02-25': 'شهادت حضرت علی علیه السلام',
        '03-04': 'عید سعید فطر',
        '03-05': 'تعطیل به مناسبت عید سعید فطر',
        '03-28': 'شهادت امام جعفر صادق علیه السلام',
        '05-10': 'عید سعید قربان',
        '05-18': 'عید سعید غدیر خم',
      },
      '1400': {
        '05-26': 'تاسوعای حسینی',
        '05-27': 'عاشورای حسینی',
        '07-05': 'اربعین حسینی',
        '07-13': 'رحلت رسول اکرم؛شهادت امام حسن مجتبی علیه السلام',
        '07-14': 'شهادت امام رضا علیه السلام',
        '07-22': 'شهادت امام حسن عسکری علیه السلام',
        '08-01': 'میلاد رسول اکرم و امام جعفر صادق علیه السلام',
        '10-16': 'شهادت حضرت فاطمه زهرا سلام الله علیها',
        '11-25': 'ولادت امام علی علیه السلام و روز پدر',
        '12-09': 'مبعث رسول اکرم',
        '12-27': 'ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان',
        '01-08': 'ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان',
        '02-13': 'شهادت حضرت علی علیه السلام',
        '02-23': 'عید سعید فطر',
        '02-24': 'تعطیل به مناسبت عید سعید فطر',
        '03-16': 'شهادت امام جعفر صادق علیه السلام',
        '04-29': 'عید سعید قربان',
        '05-06': 'عید سعید غدیر خم',
      },
      '1401': {
        '05-16': 'تاسوعای حسینی',
        '05-17': 'عاشورای حسینی',
        '06-25': 'اربعین حسینی',
        '07-02': 'رحلت رسول اکرم؛شهادت امام حسن مجتبی علیه السلام',
        '07-04': 'شهادت امام رضا علیه السلام',
        '07-12': 'شهادت امام حسن عسکری علیه السلام',
        '07-21': 'میلاد رسول اکرم و امام جعفر صادق علیه السلام',
        '10-06': 'شهادت حضرت فاطمه زهرا سلام الله علیها',
        '11-15': 'ولادت امام علی علیه السلام و روز پدر',
        '11-29': 'مبعث رسول اکرم',
        '12-16': 'ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان',
        '02-02': 'شهادت حضرت علی علیه السلام',
        '02-12': 'عید سعید فطر',
        '02-13': 'تعطیل به مناسبت عید سعید فطر',
        '03-05': 'شهادت امام جعفر صادق علیه السلام',
        '04-18': 'عید سعید قربان',
        '04-26': 'عید سعید غدیر خم',
      },
      '1402': {
        '05-05': 'تاسوعای حسینی',
        '05-06': 'عاشورای حسینی',
        '06-14': 'اربعین حسینی',
        '06-22': 'رحلت رسول اکرم؛شهادت امام حسن مجتبی علیه السلام',
        '06-24': 'شهادت امام رضا علیه السلام',
        '07-01': 'شهادت امام حسن عسکری علیه السلام',
        '07-10': 'میلاد رسول اکرم و امام جعفر صادق علیه السلام',
        '09-25': 'شهادت حضرت فاطمه زهرا سلام الله علیها',
        '11-05': 'ولادت امام علی علیه السلام و روز پدر',
        '11-19': 'مبعث رسول اکرم',
        '12-06': 'ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان',
        '01-23': 'شهادت حضرت علی علیه السلام',
        '02-01': 'عید سعید فطر',
        '02-02': 'تعطیل به مناسبت عید سعید فطر',
        '02-25': 'شهادت امام جعفر صادق علیه السلام',
        '04-07': 'عید سعید قربان',
        '04-15': 'عید سعید غدیر خم',
      },
    };

    let dates = [];

    //
    // if (ramezan[year]) {
    //   let day = `${year}-${ramezan[year][0]}`;
    //   for (let i = 0; i < 31; i++) {
    //     if (day === `${year}-${ramezan[year][1]}`) {
    //       break;
    //     }
    //     _statuses.push({
    //       calendarDayTypeId: 5,
    //       date: day,
    //       description: 'ماه رمضان',
    //       color: '#00cccc',
    //       title: 'ماه رمضان',
    //     });
    //     day = jMoment(day, 'jYYYY-jMM-jDD').add(1, 'days').format('jYYYY-jMM-jDD');
    //   }
    // }

    app._.map(shamsi, (description, day) => {
      dates.push({day: `${year}-${day}`, description: description});
    });
    if ((year + 1) % 4 === 0) {
      app._.map(kabise, (description, day) => {
        dates.push({day: `${year}-${day}`, description: description});
      });
    }

    if (ghamari[year]) {
      app._.map(ghamari[year], (description, day) => {
        dates.push({
          day: `${year}-${day}`,
          description: description,
        });
      });
    }

    if (ramezan[year]) {
      let day = `${year}-${ramezan[year][0]}`;
      for (let i = 0; i < 31; i++) {
        if (day === `${year}-${ramezan[year][1]}`) {
          break;
        }
        let index = statuses.findIndex((status) => status.date === day);
        if (index > -1) {
          statuses[index] = Object.assign({}, statuses[index], {
            calendarDayTypeId: 5,
            date: day,
            description: 'ماه رمضان',
            color: '#00cccc',
            title: 'ماه رمضان',
            static: true,
          });
        } else {
          _statuses.push({
            calendarDayTypeId: 5,
            date: day,
            description: 'ماه رمضان',
            color: '#00cccc',
            title: 'ماه رمضان',
            static: true,
          });
        }
        day = jMoment(day, 'jYYYY-jMM-jDD').add(1, 'days').format('jYYYY-jMM-jDD');
      }
    }

    app._.map(dates, (date) => {
      let index = statuses.findIndex((status) => status.date === date.day.toString());
      if (index > -1) {
        statuses[index] = Object.assign({}, statuses[index], {
          calendarDayTypeId: 2,
          date: date.day,
          description: date.description,
          color: '#cc0000',
          title: 'روز تعطیل رسمی',
        });
      } else {
        _statuses.push({
          calendarDayTypeId: 2,
          date: date.day,
          description: date.description,
          color: '#cc0000',
          title: 'روز تعطیل رسمی',
        });

      }
    });

    return _statuses;
  }

  /**
   *
   * @return {XML}
   */
  render() {
    const {year, events, onMonthClick, onWeekDayClick, onMouseDown, onMouseUp, start, selected, disabled} = this.props;
    let statuses = this._Holiday(year);
    return (
      <Card>
        <Row
          gutter={16}
        >
          {
            app.range(0, 12).map((month) => (
              <Col
                key={`month-${month + 1}`}
                xs={24} sm={12} md={8}
                style={{
                  marginTop: 16,
                }}
              >
                <Month
                  year={year}
                  month={month}
                  events={events}
                  statuses={statuses}
                  onMonthClick={onMonthClick}
                  onWeekDayClick={onWeekDayClick}
                  onMouseDown={onMouseDown}
                  onMouseUp={onMouseUp}
                  selected={selected}
                  start={start}
                  disabled={disabled}
                />
              </Col>
            ))
          }
        </Row>
      </Card>
    );
  }
}
